class ProfitAndLoss
  # 損益計算書における勘定科目の並び順を定義するクラス
  module AccountOrder
    extend ActiveSupport::Concern

    DEFAULT = {
      # 収益の部
      "売上" => 3001,
      "商品売買益" => 3002,
      "有価証券利息" => 3003,
      "貸倒引当金戻入" => 3004,
      "償却債権取立益" => 3005,
      "固定資産売却益" => 3006,
      "受取利息" => 3007,
      "受取家賃" => 3008,
      "受取地代" => 3009,
      "受取配当金" => 3010,
      "雑収入" => 3011,

      # 費用の部
      "仕入" => 4001,
      "発送費" => 4002,
      "通信費" => 4003,
      "修繕費" => 4004,
      "支払保険料" => 4005,
      "広告費" => 4006,
      "支払手数料" => 4007,
      "支払利息" => 4008,
      "旅費交通費" => 4009,
      "給料" => 4010,
      "消耗品費" => 4011,
      "租税公課" => 4012,
      "法定福利費" => 4013,
      "貸倒損失" => 4014,
      "貸倒引当金繰入" => 4015,
      "減価償却費" => 4016,
      "固定資産売却損" => 4017,
      "支払家賃" => 4018,
      "雑費" => 4019,
      "法人税、住民税及び事業税" => 4020
    }

    UNKNOWN = 999_999_999_999

    def self.account_order(name)
      DEFAULT[name] || UNKNOWN
    end
  end
end
