class BalanceSheet
  # 貸借対照表における勘定科目の並び順を定義するクラス
  module AccountOrder
    extend ActiveSupport::Concern

    DEFAULT = {
      # 資産の部
      "現金" => 1,
      "小口現金" => 2,
      "普通預金" => 3,
      "当座預金" => 4,
      "定期預金" => 5,
      "受取手形" => 6,
      "電子記録債権" => 7,
      "売掛金" => 8,
      "クレジット売掛金" => 9,
      "貸倒引当金" => 10,
      "繰越商品" => 11,
      "貯蔵品" => 12,
      "貸付金" => 13,
      "手形貸付金" => 14,
      "従業員貸付金" => 15,
      "役員貸付金" => 16,
      "未収入金" => 17,
      "前払金" => 18,
      "仮払金" => 19,
      "立替金" => 20,
      "受取商品券" => 21,
      "差入保証金" => 22,
      "土地" => 23,
      "建物" => 24,
      "建物減価償却累計額" => 25,
      "備品" => 26,
      "備品減価償却累計額" => 27,
      "車両運搬具" => 28,
      "車両運搬具減価償却累計額" => 29,
      "減価償却累計額" => 30,
      "仮払法人税等" => 31,
      "仮払消費税" => 32,
      "前払費用" => 33,
      "未収収益" => 34,

      # 負債の部
      "買掛金" => 1001,
      "支払手形" => 1002,
      "当座借越" => 1003,
      "借入金" => 1004,
      "従業員借入金" => 1005,
      "役員借入金" => 1006,
      "電子記録債務" => 1007,
      "未払金" => 1008,
      "前受金" => 1009,
      "仮受金"  => 1010,
      "預り金" => 1011,
      "未払法人税等" => 1012,
      "仮受消費税" => 1013,
      "未払消費税" => 1014,
      "未払配当金" => 1015,
      "未払費用" => 1016,
      "未払家賃" => 1017,
      "未払利息" => 1018,
      "未払地代" => 1019,
      "前受収益" => 1020,
      "前受家賃" => 1021,
      "前受利息" => 1022,
      "前受地代" => 1023,

      # 純資産の部
      "資本金" => 2001,
      "利益準備金" => 2002,
      "繰越利益剰余金" => 2003
    }

    UNKNOWN = 999_999_999_999

    def self.account_order(name)
      DEFAULT[name] || UNKNOWN
    end
  end
end
